# Вывести сумму n членов прогрессии: 1, -0.5, 0.25 и т.д.


def sum_geom(b1, q, n):
    return b1*(q**n - 1)/(q - 1)

n = int(input('Введите кол-во членов: '))

print(f'Ответ: {sum_geom(1, -0.5, n)}')